/* Localizable String */
sUIName = "Wireless Network Utility";
sUIVersion = "Utility Version";
sDriverVersion = "Driver Version: 1830.2.b17_1827.4.b22";
sCopyright = "Copyright 2016.";

// Button
OK ="OK";
CANCEL ="Cancel";
NO ="No";
YES ="Yes";
Join="Join";
Profiles="Profiles";
Join_Other="Join Other";
Show_Nets="Show Networks";
Apply="Apply";
Remove="Remove";
PIN="PIN";
PBC="PBC";
Forget="Forget this Network";

//DropDownMenu
State_RfOn="Wi-Fi: On";
State_RfOff="Wi-Fi: Off";
State_Scan="Wi-Fi: Scan Networks...";
State_Unplug="No Wireless NIC Plug in";
State_Disable="Please Enable Wireless NIC";

Radio_ON ="Turn Wi-Fi On";
Radio_OFF ="Turn Wi-Fi Off";
Join_Other_Network="Join Other Network...";
Create_Adhoc="Create Adhoc Network";
Open_Utility="Open Network Preferrence...";
Open_Preference="Open Network Preferrence...";

//ScanTable View
ScanTable_View_Title="Select the network you want to join.";
ScanTable_View_SubTitle="Select the network you want to join from the list, and then enter the network password if necessary.";
Associated="Associated";
SignalStrength="SignalStrength";
Scanning="Scanning...";

// Setting Field View
Join_BroadcastSecAP1="This network";
Join_BroadcastSecAP2="requires a";
Join_BroadcastSecAP3="password";
Join_HiddenSecAP1="This hidden network requires a";
Join_HiddenSecAP2="password";
Join_HiddenOpenAP="Enter Hidden network Name";

// Join Other
Create_Infra_Title="Enter the name of network.";
Create_Infra_SubTitle="Enter the name of the network you want to join, and then enter the password if necessary.";
Create_Adhoc_Title="Create a Computer-to-Computer network.";
Create_Adhoc_SubTitle="Enter the name of the Computer-to-Computer network you want to create.";

//Setting Field
Security_None="NONE";
Security_OpenWep="OPEN_SYSTEM WEP";
Security_SharedWep="SHARED_KEY WEP";
Security_WpaTkip="WPA_PSK TKIP";
Security_WpaAes="WPA_PSK AES";
Security_Wpa2Tkip="WPA2_PSK TKIP";
Security_Wpa2Aes="WPA2_PSK AES";
Security_WpaTkip1X="WPA Enterprise TKIP";
Security_WpaAes1X="WPA Enterprise AES";
Security_Wpa2Tkip1X="WPA2 Enterprise TKIP";
Security_Wpa2Aes1X="WPA2 Enterprise AES";
Security_WpaNoneTkip="WPA_None TKIP";
Security_WpaNoneAes="WPA_None AES";

NetworkName="Netowrk Name:";
Security="Security:";
Password="Password:";
ShowPassword="Show password";
ASCII="ASCII";
UserName="User Name:";
EAP="802.1x EAP:";
PEAP="AUTO(PEAP)";
TLS="EAP-TLS";
TTLS="EAP-TTLS";
CA_Cert="CA Certificate:";
Client_Cert="Client Certificate:";
Private_Key="Private Key:";
Private_Key_Pwd="Private Key Password:";
Choose_Private_Key="Choose private key file (PFX/KEY)";
Choose_Client_Cert="Choose client certificate file (PEM/DER)";
Choose_CA_Cert="Choose CA certificate file (PEM/DER)";

// Profiles
PreferredNet="Preferred Networks:";
StateTitle="State";
SecurityTitle="Security";

//WPS 
WPS_Title="Please key the PIN code into your AP's config page";
WPS_Progress="WPS Progress :";
WPS_init_Str = "  initialize WPS process  ";
WPS_scan_Str = "  Scan Active WPS AP  ";
WPS_connect_Str = "  Connect to Active WPS AP  ";
WPS_handshake_Str ="  Initialize the WPS handshake  ";
WPS_exchange_Str ="  Exchange WPS Message  ";
WPS_done_Str = "  Exchange WPS Message [Done]  ";
WPS_fail_Str = "  Exchange WPS Message Fail , Try to connect other WPS AP  ";
WPS_start_Str = "  WPS START ";
WPS_finish_Str = "     WPS Protocol Finished !!";
WPS_auto_connect_Str = "It will connect to WPS AP automatically.";
WPS_timeout_Str = "     WPS Time Out !!";
WPS_connection_failed_Str = " Connection failed. Please try again later !!";

Wps_overlap_Str = "Session Overlap";
Wps_more_pbc_Str = "     More then One AP in PBC Mode !!";
Wps_retry_Str = "Please use PIN or wait for a while and try again";

ERROR0 = "ERROR";
ERROR1 = "Please input key!";
ERROR2 = "Incorrect wep key index!!!";
ERROR3 = "The key length is between 8 and 64!";
ERROR4 = "The network key is not of heximal format!";
ERROR5 = "The length of the ASCII key must be 5 or 13!";
ERROR6 = "The length of the network key is not correct!";
ERROR7 = "The length of the network key must be 10 or 26!";
ERROR8 = "The Network key and Confirm key is not the same!";
ERROR9 = "The network key is not of ASCII format!";
ERROR10 = "The network key is not of 64HEX format!";
ERROR11 = "This ChannelPlan can't join Adhoc with channel 12,13 or Band2, Band3!!";
ERROR12 = "Can't join Adhoc with WPA-NONE !!";
ERROR13 = "Can't join Adhoc with WPA2-PSK !!";
ERROR14 = "WPA/WPA2 Enterprise isn't support !!";

WARNING0 = "Warning";
WARNING1 = "Please input SSID";
WARNING2 = "Please input profile Name";
WARNING3 = "The length of SSID characters is large than 32.";
WARNING4 = "The profile already exists. Do you want to overwrite it?";
WARNING5 = "Are you sure that you want to delete the selected Profile?";

NOTICE0 = "NOTICE";
NOTICE1 = "AP mode error.";
NOTICE2 = "STA mode error.";
NOTICE3 = "QOSMode Set value fail";
NOTICE4 = "QOSMode Get value fail";
NOTICE5 = "QOSMode incorrect value";	
NOTICE6 = "RTSThreshold Out of range.(0 ~ 2432)";
NOTICE7 = "FragmentationThreshold Out of range.(256 ~ 2432)";
NOTICE8 = "Please enable the WLAN card in the Network item of System Preferences.";
NOTICE9 = "Connect your Wlan adapter to your computer";
NOTICE10 = "Wrong password, please try again";